spa/cypress/fixtures/donations/18-results.json

[
    {
        "id": 17,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:51.075931Z",
        "modified": "2021-06-21T16:21:42.402755Z",
        "amount": 1384,
        "currency": "usd",
        "reason": "",
        "interval": "one_time",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-20T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "paid",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 1,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-15T16:17:38.189182Z",
        "modified": "2021-06-21T16:21:42.411177Z",
        "amount": 1183,
        "currency": "usd",
        "reason": "",
        "interval": "one_time",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-19T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "paid",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 18,
        "contributor_email": "bar@bizz.com",
        "created": "2021-06-18T13:52:51.819007Z",
        "modified": "2021-06-21T16:21:42.414687Z",
        "amount": 1382,
        "currency": "usd",
        "reason": "",
        "interval": "one_time",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-18T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "paid",
        "contributor": 2,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 6,
        "contributor_email": "ar@bizz.com",
        "created": "2021-06-18T13:52:44.795983Z",
        "modified": "2021-06-21T16:21:42.418046Z",
        "amount": 1381,
        "currency": "usd",
        "reason": "",
        "interval": "month",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-17T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "paid",
        "contributor": 3,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 2,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-15T16:17:57.052645Z",
        "modified": "2021-06-21T16:21:42.421513Z",
        "amount": 1398,
        "currency": "usd",
        "reason": "",
        "interval": "month",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-16T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "paid",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 3,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:40.484715Z",
        "modified": "2021-06-21T16:21:42.424788Z",
        "amount": 1397,
        "currency": "usd",
        "reason": "",
        "interval": "month",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-15T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "paid",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 4,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:43.602593Z",
        "modified": "2021-06-21T16:21:42.427521Z",
        "amount": 1396,
        "currency": "usd",
        "reason": "",
        "interval": "month",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-14T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "processing",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 5,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:44.195210Z",
        "modified": "2021-06-21T16:21:42.429904Z",
        "amount": 1395,
        "currency": "usd",
        "reason": "",
        "interval": "one_time",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-13T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "processing",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 7,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:45.401084Z",
        "modified": "2021-06-21T16:21:42.431855Z",
        "amount": 1394,
        "currency": "usd",
        "reason": "",
        "interval": "one_time",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-12T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "processing",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 8,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:45.997845Z",
        "modified": "2021-06-21T16:21:42.433937Z",
        "amount": 1393,
        "currency": "usd",
        "reason": "",
        "interval": "one_time",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-11T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "processing",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 9,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:46.617122Z",
        "modified": "2021-06-21T16:21:42.435817Z",
        "amount": 1392,
        "currency": "usd",
        "reason": "",
        "interval": "one_time",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-10T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "processing",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 10,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:47.141215Z",
        "modified": "2021-06-21T16:21:42.437605Z",
        "amount": 1391,
        "currency": "usd",
        "reason": "",
        "interval": "one_time",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-09T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "paid",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 11,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:47.732185Z",
        "modified": "2021-06-21T16:21:42.439499Z",
        "amount": 1390,
        "currency": "usd",
        "reason": "",
        "interval": "year",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-08T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "paid",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 12,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:48.280073Z",
        "modified": "2021-06-21T16:21:42.441180Z",
        "amount": 1389,
        "currency": "usd",
        "reason": "",
        "interval": "year",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-07T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "failed",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 13,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:48.852287Z",
        "modified": "2021-06-21T16:21:42.442784Z",
        "amount": 1388,
        "currency": "usd",
        "reason": "",
        "interval": "year",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-06T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "failed",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 14,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:49.409528Z",
        "modified": "2021-06-21T16:21:42.444249Z",
        "amount": 1387,
        "currency": "usd",
        "reason": "",
        "interval": "one_time",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-05T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "failed",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 15,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:49.979336Z",
        "modified": "2021-06-21T16:21:42.445517Z",
        "amount": 1386,
        "currency": "usd",
        "reason": "",
        "interval": "one_time",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-04T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "failed",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    },
    {
        "id": 16,
        "contributor_email": "contributor@caktusgroup.com",
        "created": "2021-06-18T13:52:50.527737Z",
        "modified": "2021-06-21T16:21:42.446952Z",
        "amount": 1385,
        "currency": "usd",
        "reason": "",
        "interval": "year",
        "payment_provider_used": "Stripe",
        "payment_provider_data": null,
        "provider_payment_id": null,
        "provider_customer_id": null,
        "provider_payment_method_id": null,
        "last_payment_date": "2021-06-03T16:20:08.388855Z",
        "bad_actor_score": null,
        "bad_actor_response": null,
        "flagged_date": null,
        "status": "failed",
        "contributor": 1,
        "donation_page": null,
        "organization": 1
    }
]